tests/fixtures/laguuni/booking/order-success-details.json

{
  "id": "116640",
  "payment": "cash",
  "delivery": null,
  "name": "Test User",
  "company": null,
  "phone": "+358 40 1234567",
  "email": "test@example.com",
  "address": null,
  "zip": null,
  "city": null,
  "country": null,
  "evoice": null,
  "evoiceint": null,
  "processed": "0",
  "orderdate": "1778009377",
  "expirationdate": null,
  "paid": "1",
  "completed": "1",
  "confirmed": "2",
  "totalVatFree": "0",
  "total": "0",
  "more": null,
  "identifier": "c7fd654a37873cbc39d23c5d42604795",
  "transactionid": null,
  "status": null,
  "totalVat": "0",
  "totalWithDeliveryVatFree": "0",
  "totalWithDeliveryVat": "0",
  "totalWithDelivery": "0",
  "src": null,
  "refundidentifier": null,
  "refunded": "0",
  "deliverycount": "1",
  "datestart": "0",
  "invoicedate": "1778009377",
  "paymentdate": "1777928400",
  "groupdeal": null,
  "groupdealstatus": null,
  "basket_id": "1227434",
  "ident": null,
  "aftersales_sent": null,
  "processdate": null,
  "stripecustomer": null,
  "stripesource": null,
  "version": "fi_FI",
  "master": "1",
  "hidden": "0",
  "consolidated": "0",
  "origin": "laguuni",
  "pos_id": null,
  "pos_name": null,
  "reference": null,
  "yourreference": null,
  "mark": null,
  "customer_id": "269",
  "interest": null,
  "pay_option1_duedays": null,
  "trackingcode": null,
  "skip_notifications": "0",
  "override_services": "0",
  "locked": "0",
  "archived": "0",
  "notes": null,
  "billing_name": null,
  "billing_address": null,
  "billing_zip": null,
  "billing_city": null,
  "billing_country": null,
  "billing_email": null,
  "billing_billingemail": null,
  "billing_company": null,
  "billing_department": null,
  "billing_evoice": null,
  "billing_evoiceint": null,
  "billing_phone": null,
  "billing_ident": null,
  "billing_paymentterm": null,
  "billingcustomer_id": null,
  "consolidate_id": null,
  "deliveryname": null,
  "deliveryprice": null,
  "deliveryvat": null,
  "paymentlinksent": "0",
  "pinned": null,
  "triptype": null,
  "verifiedcustomer_id": null,
  "paymentplan": null,
  "sharedTag": [],
  "ownDelivery": [],
  "rows": [
    {
      "count": "1",
      "resource_count": "1",
      "reservation_count": "1",
      "selected_resources": false,
      "dimensions": [],
      "id": "6",
      "name": "Wakeboarding Pro-kaapeli (8.5.2026 klo 15.00 - 16.00)",
      "pricetiers": "M\u00e4\u00e4r\u00e4: 1",
      "realpricetiers": false,
      "packages": "",
      "price": "26",
      "vat": "13.5",
      "special": null,
      "hide_units": "0",
      "start_ts": "1778241600",
      "netvisoraccount": null,
      "netvisorvatcode": null,
      "product_subtype": "2",
      "hide_numbers": false,
      "is_reservation": true
    },
    {
      "count": "1",
      "resource_count": 1,
      "reservation_count": 1,
      "selected_resources": false,
      "dimensions": [],
      "id": "DIS",
      "name": "Alennus (FIXTURE-DISCOUNT)",
      "pricetiers": "",
      "realpricetiers": true,
      "packages": "",
      "price": "-26",
      "vat": "13.5",
      "special": null,
      "hide_units": null,
      "start_ts": null,
      "netvisoraccount": null,
      "netvisorvatcode": null,
      "product_subtype": null,
      "hide_numbers": false,
      "is_reservation": false
    }
  ],
  "ownItem": [
    {
      "id": "249253",
      "product_id": "6",
      "count": "1",
      "basket_id": null,
      "reservation_datestart": "8.5.2026",
      "reservation_dateend": null,
      "reservation_timestart": "15.00",
      "reservation_timeend": "16.00",
      "start_ts": "1778241600",
      "end_ts": "1778245200",
      "reservation_desc": "8.5.2026 klo 15.00 - 16.00",
      "order_id": "116640",
      "price": "26",
      "vat": "13.5",
      "bill_id": "107115",
      "discount_id": null,
      "update_ts": "1778014777",
      "invoice_ts": "1778009377",
      "product_name": "Wakeboarding Pro-kaapeli",
      "product_unit": "1",
      "product_unittype": "2",
      "product_subtype": "2",
      "item_id": null,
      "commission_id": null,
      "special": null,
      "reservation_count": "1",
      "resource_count": "1",
      "selected_resources": null,
      "pricetiers": "",
      "discountedprice": "0",
      "parent_id": null,
      "hide_units": "0",
      "hide_pricing": "0",
      "hidden": "0",
      "currency": "EUR",
      "origin": null,
      "destination": null,
      "locked": null,
      "netvisoraccount": null,
      "netvisorvatcode": null,
      "show_id": null,
      "valuecard_id": null,
      "zone_id": null,
      "modifier_id": "249255",
      "previous": null,
      "voucher_id": null,
      "reporting_price": null,
      "discountlocked": null,
      "erpaccount": null,
      "optiontype": null,
      "pricing_id": null,
      "isdelivery": null,
      "delivery_id": null,
      "delivery_ts": null,
      "maintenancewindow": null,
      "packages": null,
      "loyalty": null,
      "requiredinfo": "minimalphone",
      "terms_id": null,
      "form_id": null,
      "formresponse": null,
      "paymentplan": null,
      "originalreservation_id": null,
      "product": {
        "id": "6",
        "name": "Wakeboarding Pro-kaapeli",
        "marketingname": "",
        "usemarketingname": "0",
        "description": "<p>Ihanteellinen harrastajille, sopii kaikille. Varaa t\u00e4st\u00e4 pelkk\u00e4 ajoaika, jos sulla on omat v\u00e4lineet!<\/p>",
        "type": "1",
        "subtype": "2",
        "displayedtype": "generic",
        "product_unit": "1",
        "product_units": "1h;2h;3h",
        "unit_type": "2",
        "warehouse_count": "0",
        "price": "26",
        "minprice": null,
        "maxprice": null,
        "vat": "13.5",
        "start_time": null,
        "end_time": null,
        "productname": null,
        "allow_sale_under_warehouse": "0",
        "displayname": "1",
        "displaydescription": "1",
        "displayimage": "1",
        "displayprice": "1",
        "pay_reservation_online": "0",
        "client_rental": "0",
        "buttontext": "",
        "file_id": "1072",
        "file_ext": "jpg",
        "reservation_mode": null,
        "allow_multiday": "0",
        "multiday_limit": "0",
        "enable_calendar": "0",
        "calendar_id": "",
        "enable_catalog": "fi_FI;en_US;de_DE",
        "enable_category": "4928;7741;10909;11372;11372;13695;13695;13695;13695;13695;13695;13695;13695;13695;13695;13695;13695;13695;13695;13695;13695;13695;13695;13695;13695;13695;13695;13695;13695;13695;13695;13695;13695;13695;13695;13695;13695;13695;13695;13695;13695;13695;;20532;20532;21275;21348;22326;22362;22362;22364;22364;23310;23310",
        "enable_gofinland": "0",
        "enable_retkipaikka": "0",
        "file_title": null,
        "file_description": null,
        "allowedstarttimes": "",
        "dailystarttime": null,
        "dailyendtime": null,
        "preselecteddates": "",
        "deleted": "0",
        "archived": "0",
        "social_sharing_text": null,
        "social_sharing_urltype": null,
        "social_sharing_url": null,
        "min_count": null,
        "deadline": null,
        "deadlineoffset": "0",
        "reservableuntil": null,
        "enable_availability": "1",
        "hide_times": "0",
        "hide_units": "0",
        "shop_id": "d0b13ef9ba061e31992eab3c08801eb6",
        "product_id": null,
        "embedcode": null,
        "basketembedcode": null,
        "availabilityembedcode": null,
        "multiple_prices": "1",
        "margin_travel_agent": null,
        "displaystock": "1",
        "channeldata_id": "13",
        "enable_participant_pricing": "1",
        "gofinlandid": null,
        "externalid": "0",
        "externalrate": "0",
        "quantitytitle": "Henkil\u00f6m\u00e4\u00e4r\u00e4",
        "ma_propertyid": null,
        "ma_roomid": null,
        "ma_channels": null,
        "price_vat": 29.51,
        "hide_pricing": "0",
        "hide_capacity": "0",
        "ean": "",
        "netvisorid": "123",
        "pricing_id": null,
        "vouchers": "1",
        "voucher_id": null,
        "voucher_start": "",
        "voucher_end": "",
        "canonical": "wakeboarding-pro-kaapeli",
        "maxallowedseats": "0",
        "smartum_benefit": "exercise",
        "epassi_benefit": "sport",
        "edenred_benefit": "exercise",
        "erpaccount": null,
        "optionstitle": "Tarvitsetko jotain muuta?",
        "enable_deliverymethods_storefront": null,
        "display_name_in_workflow": "0",
        "limit_availability": "0",
        "maintenancewindow": null,
        "display_optionprice": "0",
        "accommodationtype": null,
        "scheduledtasks": null,
        "enable_bokun": "0",
        "bokun_id": null,
        "packagingtitle": null,
        "mobileimage_id": null,
        "mobileimage_ext": "",
        "loyalty": null,
        "requiredinfo": "minimalphone",
        "terms_id": null,
        "form_id": null,
        "mainimagelayout": "large",
        "mobilepayqr": null,
        "paymentplan_id": null
      },
      "packagetotal": null
    },
    {
      "id": "249255",
      "product_id": null,
      "count": "1",
      "basket_id": null,
      "reservation_datestart": null,
      "reservation_dateend": null,
      "reservation_timestart": null,
      "reservation_timeend": null,
      "start_ts": null,
      "end_ts": null,
      "reservation_desc": "26 EUR , Wakeboarding Pro-kaapeli",
      "order_id": "116640",
      "price": "-26",
      "vat": "13.5",
      "bill_id": "107115",
      "discount_id": "2796",
      "update_ts": null,
      "invoice_ts": "1778009377",
      "product_name": "FIXTURE-DISCOUNT",
      "product_unit": null,
      "product_unittype": null,
      "product_subtype": null,
      "item_id": null,
      "commission_id": null,
      "special": null,
      "reservation_count": null,
      "resource_count": null,
      "selected_resources": null,
      "pricetiers": null,
      "discountedprice": null,
      "parent_id": null,
      "hide_units": null,
      "hide_pricing": null,
      "hidden": "0",
      "currency": "EUR",
      "origin": null,
      "destination": null,
      "locked": null,
      "netvisoraccount": null,
      "netvisorvatcode": null,
      "show_id": null,
      "valuecard_id": null,
      "zone_id": null,
      "modifier_id": null,
      "previous": null,
      "voucher_id": null,
      "reporting_price": null,
      "discountlocked": "0",
      "erpaccount": null,
      "optiontype": null,
      "pricing_id": null,
      "isdelivery": null,
      "delivery_id": null,
      "delivery_ts": null,
      "maintenancewindow": null,
      "packages": null,
      "loyalty": null,
      "requiredinfo": "minimal",
      "terms_id": null,
      "form_id": null,
      "formresponse": null,
      "paymentplan": null,
      "originalreservation_id": null,
      "packagetotal": null
    }
  ]
}
